int/auto/OWSWSMigration/resources/dataBank/TeamEnv/Req/New Text Document.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:name="http://webservices.micros.com/ows/5.1/Name.wsdl">
   <soapenv:Header>
      <OGHeader primaryLangID="E" timeStamp="KEYWORD_GMT_TIMESTAMP" transactionID="1100" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <Origin entityID="NRICH1" systemType="WEB"/>
         <Destination entityID="TI" systemType="ORS"/>
         <Authentication>
            <UserCredentials>
               <UserName>SUPERVISOR</UserName>
               <UserPassword>SCRUMBIZ10</UserPassword>
               <Domain>NIRMAL</Domain>
            </UserCredentials>
         </Authentication>
      </OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <name:FetchProfileRequest>
         <!--Optional:-->
         <name:NameID type="INTERNAL" source="OPERA">Var_NameID</name:NameID>
      </name:FetchProfileRequest>
   </soapenv:Body>
</soapenv:Envelope>